inst/Correction-TTE/example.org
#+TITLE: Generalized Pairwise Comparison - bias correction (example)

Load package
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
library(BuyseTest) # BuyseTest version 1.3
#+END_SRC

#+RESULTS:

Load data
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
df <- data.frame("survie" = c(2.1, 4.1, 6.1, 8.1, 4, 6, 8, 10), 
                 "event" = c(1, 1, 1, 0, 1, 0, 0, 1), 
                 "group" = c(0, 0, 0, 0, 1, 1, 1, 1))
df
#+END_SRC

#+RESULTS:
:   survie event group
: 1    2.1     1     0
: 2    4.1     1     0
: 3    6.1     1     0
: 4    8.1     0     0
: 5    4.0     1     1
: 6    6.0     0     1
: 7    8.0     0     1
: 8   10.0     1     1

Default options:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BuyseTest.options(method = "Peron", method.inference = "none")
#+END_SRC

#+RESULTS:

\clearpage

* No correction

Run GPC:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BT_Peron <- BuyseTest(group ~ tte(survie, censoring = event, threshold = 1),
                      data = df)
#+END_SRC

#+RESULTS:
: Settings (punctual estimation) 
:    > reference: Control = 0 and Treatment = 1
:    > 1 endpoint: 
:       |priority endpoint type          operator            threshold censoring |
:       |1        survie   time to event higher is favorable 1         event     |
:    > management of neutral pairs : re-analyzed using endpoints of lower priority (if any) 
:    > management of censored survival pairs : imputation using different survival curve for control and treatment patients 
: Punctual estimation (done)

Display results (percentage):
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
summary(BT_Peron)
#+END_SRC

#+RESULTS:
:         Generalized pairwise comparison with 1 prioritized endpoint
: 
:  > statistic       : net chance of a better outcome (delta: endpoint specific, Delta: global) 
:  > null hypothesis : Delta == 0 
:  > groups          : 0 (control) vs. 1 (treatment) 
:  > results
:  endpoint threshold total favorable unfavorable neutral uninf delta Delta
:    survie         1   100      62.5        12.5    6.25 18.75   0.5   0.5

Display results (number of pairs):
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
summary(BT_Peron, percentage = FALSE)
#+END_SRC

#+RESULTS:
:         Generalized pairwise comparison with 1 prioritized endpoint
: 
:  > statistic       : net chance of a better outcome (delta: endpoint specific, Delta: global) 
:  > null hypothesis : Delta == 0 
:  > groups          : 0 (control) vs. 1 (treatment) 
:  > results
:  endpoint threshold total favorable unfavorable neutral uninf delta Delta
:    survie         1    16        10           2       1     3   0.5   0.5

\clearpage

* Manual correction:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
table <- summary(BT_Peron, percentage = FALSE, show = FALSE)$table
vec.count <- table[table$strata == "global",
                   c("n.favorable","n.unfavorable","n.neutral","n.uninf")]
vec.count
#+END_SRC

#+RESULTS:
:   n.favorable n.unfavorable n.neutral n.uninf
: 1          10             2         1       3

Multiplicative factor:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
factor <- sum(vec.count)/as.double(sum(vec.count)-vec.count["n.uninf"])
factor
#+END_SRC

#+RESULTS:
: [1] 1.230769

Corrected output (number of pairs):
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
vec.count2 <- vec.count[1:3]*factor
vec.count2
#+END_SRC

#+RESULTS:
:   n.favorable n.unfavorable n.neutral
: 1    12.30769      2.461538  1.230769

Corrected output (percentage of pairs):
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
vec.count2/sum(vec.count)
#+END_SRC

#+RESULTS:
:   n.favorable n.unfavorable  n.neutral
: 1   0.7692308     0.1538462 0.07692308

\clearpage

* Automatic correction

Run GPC with correction (argument =correctionTTE=)
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BT_PeronC <- BuyseTest(group ~ tte(survie, censoring = event, threshold = 1),
                       correctionTTE = TRUE,                      
                       data = df)
#+END_SRC

#+RESULTS:
: Settings (punctual estimation) 
:    > reference: Control = 0 and Treatment = 1
:    > 1 endpoint: 
:       |priority endpoint type          operator            threshold censoring |
:       |1        survie   time to event higher is favorable 1         event     |
:    > management of neutral pairs : re-analyzed using endpoints of lower priority (if any) 
:    > management of censored survival pairs : imputation using different survival curve for control and treatment patients 
: Punctual estimation (done)

Display results (percentage):
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
summary(BT_PeronC)
#+END_SRC

#+RESULTS:
:         Generalized pairwise comparison with 1 prioritized endpoint
: 
:  > statistic       : net chance of a better outcome (delta: endpoint specific, Delta: global) 
:  > null hypothesis : Delta == 0 
:  > groups          : 0 (control) vs. 1 (treatment) 
:  > results
:  endpoint threshold total favorable unfavorable neutral uninf delta Delta
:    survie         1   100     76.92       15.38    7.69     0 0.615 0.615

Display results (number of pairs):
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
summary(BT_PeronC, percentage = FALSE)
#+END_SRC

#+RESULTS:
:         Generalized pairwise comparison with 1 prioritized endpoint
: 
:  > statistic       : net chance of a better outcome (delta: endpoint specific, Delta: global) 
:  > null hypothesis : Delta == 0 
:  > groups          : 0 (control) vs. 1 (treatment) 
:  > results
:  endpoint threshold total favorable unfavorable neutral uninf delta Delta
:    survie         1    16     12.31        2.46    1.23     0 0.615 0.615



* CONFIG :noexport:
# #+LaTeX_HEADER:\affil{Department of Biostatistics, University of Copenhagen, Copenhagen, Denmark}
#+LANGUAGE:  en
#+LaTeX_CLASS: org-article
#+OPTIONS:   title:t author:t toc:nil todo:nil
#+OPTIONS:   H:3 num:t 
#+OPTIONS:   TeX:t LaTeX:t

** Code
#+PROPERTY: header-args :session *R*
#+PROPERTY: header-args :tange yes % extract source code: http://orgmode.org/manual/Extracting-source-code.html
#+PROPERTY: header-args :eval yes :cache no
#+LATEX_HEADER: \RequirePackage{fancyvrb}
#+LATEX_HEADER: \DefineVerbatimEnvironment{verbatim}{Verbatim}{fontsize=\small,formatcom = {\color[rgb]{0.5,0,0}}}

** Display 
#+LATEX_HEADER: \RequirePackage{colortbl} % arrayrulecolor to mix colors
#+LATEX_HEADER: \RequirePackage{setspace} % to modify the space between lines - incompatible with footnote in beamer
#+LaTeX_HEADER:\usepackage{authblk} % enable several affiliations (clash with beamer)

** Image
#+LATEX_HEADER: \RequirePackage{epstopdf} % to be able to convert .eps to .pdf image files

** Latex command
#+LaTeX_HEADER: %
#+LaTeX_HEADER: %%%% additional latex commands %%%%
#+LaTeX_HEADER: %

** Algorithm
#+LATEX_HEADER: \RequirePackage{amsmath}
#+LATEX_HEADER: \RequirePackage{algorithm}
#+LATEX_HEADER: \RequirePackage[noend]{algpseudocode}

** Math
#+LATEX_HEADER: \RequirePackage{ifthen}
#+LATEX_HEADER: \RequirePackage{xspace} % space for newcommand macro
#+LATEX_HEADER: \RequirePackage{xifthen}
#+LATEX_HEADER: \RequirePackage{xargs}
#+LATEX_HEADER: \RequirePackage{dsfont}
#+LATEX_HEADER: \RequirePackage{amsmath,stmaryrd,graphicx}
#+LATEX_HEADER: \RequirePackage{prodint} % product integral symbol (\PRODI)

# ## lemma
#+LaTeX_HEADER: \RequirePackage{amsthm}
#+LaTeX_HEADER: \newtheorem{theorem}{Theorem}
#+LaTeX_HEADER: \newtheorem{lemma}[theorem]{Lemma}

*** Template for shortcut
#+LATEX_HEADER: \newcommand\defOperator[7]{%
#+LATEX_HEADER:	\ifthenelse{\isempty{#2}}{
#+LATEX_HEADER:		\ifthenelse{\isempty{#1}}{#7{#3}#4}{#7{#3}#4 \left#5 #1 \right#6}
#+LATEX_HEADER:	}{
#+LATEX_HEADER:	\ifthenelse{\isempty{#1}}{#7{#3}#4_{#2}}{#7{#3}#4_{#1}\left#5 #2 \right#6}
#+LATEX_HEADER: }
#+LATEX_HEADER: }

#+LATEX_HEADER: \newcommand\defUOperator[5]{%
#+LATEX_HEADER: \ifthenelse{\isempty{#1}}{
#+LATEX_HEADER:		#5\left#3 #2 \right#4
#+LATEX_HEADER: }{
#+LATEX_HEADER:	\ifthenelse{\isempty{#2}}{\underset{#1}{\operatornamewithlimits{#5}}}{
#+LATEX_HEADER:		\underset{#1}{\operatornamewithlimits{#5}}\left#3 #2 \right#4}
#+LATEX_HEADER: }
#+LATEX_HEADER: }

#+LATEX_HEADER: \newcommand{\defBoldVar}[2]{	
#+LATEX_HEADER:	\ifthenelse{\equal{#2}{T}}{\boldsymbol{#1}}{\mathbf{#1}}
#+LATEX_HEADER: }

*** Shortcuts

**** Probability
#+LATEX_HEADER: \newcommandx\Cov[2][1=,2=]{\defOperator{#1}{#2}{C}{ov}{\lbrack}{\rbrack}{\mathbb}}
#+LATEX_HEADER: \newcommandx\Esp[2][1=,2=]{\defOperator{#1}{#2}{E}{}{\lbrack}{\rbrack}{\mathbb}}
#+LATEX_HEADER: \newcommandx\Prob[2][1=,2=]{\defOperator{#1}{#2}{P}{}{\lbrack}{\rbrack}{\mathbb}}
#+LATEX_HEADER: \newcommandx\Qrob[2][1=,2=]{\defOperator{#1}{#2}{Q}{}{\lbrack}{\rbrack}{\mathbb}}
#+LATEX_HEADER: \newcommandx\Var[2][1=,2=]{\defOperator{#1}{#2}{V}{ar}{\lbrack}{\rbrack}{\mathbb}}

#+LATEX_HEADER: \newcommandx\Binom[2][1=,2=]{\defOperator{#1}{#2}{B}{}{(}{)}{\mathcal}}
#+LATEX_HEADER: \newcommandx\Gaus[2][1=,2=]{\defOperator{#1}{#2}{N}{}{(}{)}{\mathcal}}
#+LATEX_HEADER: \newcommandx\Wishart[2][1=,2=]{\defOperator{#1}{#2}{W}{ishart}{(}{)}{\mathcal}}

#+LATEX_HEADER: \newcommandx\Likelihood[2][1=,2=]{\defOperator{#1}{#2}{L}{}{(}{)}{\mathcal}}
#+LATEX_HEADER: \newcommandx\Information[2][1=,2=]{\defOperator{#1}{#2}{I}{}{(}{)}{\mathcal}}
#+LATEX_HEADER: \newcommandx\Score[2][1=,2=]{\defOperator{#1}{#2}{S}{}{(}{)}{\mathcal}}

**** Operators
#+LATEX_HEADER: \newcommandx\Vois[2][1=,2=]{\defOperator{#1}{#2}{V}{}{(}{)}{\mathcal}}
#+LATEX_HEADER: \newcommandx\IF[2][1=,2=]{\defOperator{#1}{#2}{IF}{}{(}{)}{\mathcal}}
#+LATEX_HEADER: \newcommandx\Ind[1][1=]{\defOperator{}{#1}{1}{}{(}{)}{\mathds}}

#+LATEX_HEADER: \newcommandx\Max[2][1=,2=]{\defUOperator{#1}{#2}{(}{)}{min}}
#+LATEX_HEADER: \newcommandx\Min[2][1=,2=]{\defUOperator{#1}{#2}{(}{)}{max}}
#+LATEX_HEADER: \newcommandx\argMax[2][1=,2=]{\defUOperator{#1}{#2}{(}{)}{argmax}}
#+LATEX_HEADER: \newcommandx\argMin[2][1=,2=]{\defUOperator{#1}{#2}{(}{)}{argmin}}
#+LATEX_HEADER: \newcommandx\cvD[2][1=D,2=n \rightarrow \infty]{\xrightarrow[#2]{#1}}

#+LATEX_HEADER: \newcommandx\Hypothesis[2][1=,2=]{
#+LATEX_HEADER:         \ifthenelse{\isempty{#1}}{
#+LATEX_HEADER:         \mathcal{H}
#+LATEX_HEADER:         }{
#+LATEX_HEADER: 	\ifthenelse{\isempty{#2}}{
#+LATEX_HEADER: 		\mathcal{H}_{#1}
#+LATEX_HEADER: 	}{
#+LATEX_HEADER: 	\mathcal{H}^{(#2)}_{#1}
#+LATEX_HEADER:         }
#+LATEX_HEADER:         }
#+LATEX_HEADER: }

#+LATEX_HEADER: \newcommandx\dpartial[4][1=,2=,3=,4=\partial]{
#+LATEX_HEADER: 	\ifthenelse{\isempty{#3}}{
#+LATEX_HEADER: 		\frac{#4 #1}{#4 #2}
#+LATEX_HEADER: 	}{
#+LATEX_HEADER: 	\left.\frac{#4 #1}{#4 #2}\right\rvert_{#3}
#+LATEX_HEADER: }
#+LATEX_HEADER: }

#+LATEX_HEADER: \newcommandx\dTpartial[3][1=,2=,3=]{\dpartial[#1][#2][#3][d]}

#+LATEX_HEADER: \newcommandx\ddpartial[3][1=,2=,3=]{
#+LATEX_HEADER: 	\ifthenelse{\isempty{#3}}{
#+LATEX_HEADER: 		\frac{\partial^{2} #1}{\left( \partial #2\right)^2}
#+LATEX_HEADER: 	}{
#+LATEX_HEADER: 	\frac{\partial^2 #1}{\partial #2\partial #3}
#+LATEX_HEADER: }
#+LATEX_HEADER: } 

**** General math
#+LATEX_HEADER: \newcommand\Real{\mathbb{R}}
#+LATEX_HEADER: \newcommand\Rational{\mathbb{Q}}
#+LATEX_HEADER: \newcommand\Natural{\mathbb{N}}
#+LATEX_HEADER: \newcommand\trans[1]{{#1}^\intercal}%\newcommand\trans[1]{{\vphantom{#1}}^\top{#1}}
#+LATEX_HEADER: \newcommand{\independent}{\mathrel{\text{\scalebox{1.5}{$\perp\mkern-10mu\perp$}}}}
#+LaTeX_HEADER: \newcommand\half{\frac{1}{2}}
#+LaTeX_HEADER: \newcommand\normMax[1]{\left|\left|#1\right|\right|_{max}}
#+LaTeX_HEADER: \newcommand\normTwo[1]{\left|\left|#1\right|\right|_{2}}
